In [1]:
#Step-1
#Import Libraries

import pandas as pd
import numpy as np
from sklearn import linear_model

In [7]:
#import Files to the local sysytem
df = pd.read_csv("bedroom.csv")

In [8]:
#Check wheteher file os loaded or not
df.head()

   area  bedroom  age   price
0  2600      3.0   20  550000
1  3000      4.0   15  565000
2  3200      NaN   18  610000
3  3600      3.0   30  595000
4  4000      5.0    8  760000

In [9]:
#Data Preprocessing - Beacuse we have one Null value in bedroom column

# Data Preprocessing

In [10]:
#Caluclationg Mean Value
df.bedroom.mean()

3.75

In [11]:
#Converting Float to Normal value
import math
mean_bedroom = math.floor(df.bedroom.mean())
mean_bedroom

3

In [12]:
#Replacing the null value by mean value 
df.bedroom.fillna(mean_bedroom)

0    3.0
1    4.0
2    3.0
3    3.0
4    5.0
Name: bedroom, dtype: float64

In [13]:
#Replacing the null value by mean value 
df.bedroom =df.bedroom.fillna(mean_bedroom)

In [14]:
#Checking whether the null value is existing or not
df

   area  bedroom  age   price
0  2600      3.0   20  550000
1  3000      4.0   15  565000
2  3200      3.0   18  610000
3  3600      3.0   30  595000
4  4000      5.0    8  760000

In [15]:
x=df[['age','bedroom','age']] # defining variable into x axies

In [16]:
x #check wheteher the values are stored or not

   age  bedroom  age
0   20      3.0   20
1   15      4.0   15
2   18      3.0   18
3   30      3.0   30
4    8      5.0    8

In [17]:
y=df[['price']] # defining variable into x axies

In [18]:
y #check wheteher the values are stored or not

    price
0  550000
1  565000
2  610000
3  595000
4  760000

# Tain DataSet

In [19]:
from sklearn.model_selection import train_test_split  #import model selection libraries

In [20]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.33, random_state=42) # define test size and random state

# Model Selection

In [21]:
from sklearn.linear_model import LinearRegression #import model

In [22]:
lr = LinearRegression() #model function stored in varible

In [23]:
lr.fit(x_train,y_train) #fit train data

LinearRegression()

In [24]:
pre=lr.predict(x_test) #predict test data

In [27]:
fit=lr.fit(x,y) #Fit entire data

In [28]:
fit.score(x,y) # Score value of x,y

0.6256382537185217

In [29]:
lr.predict([(3000,3,40)]) #predict Existing value

array([[1962628.39879176]])